{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "storage" : "model.espresso.weights",
  "format_version" : 200,
  "layers" : [
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "stem_bn1_output",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "stem_conv1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "image",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_1_output",
      "type" : "activation",
      "name" : "activation_1",
      "bottom" : "stem_bn1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "reduction_bn_1_stem_1_output",
      "blob_weights" : 7,
      "K" : 32,
      "blob_biases" : 5,
      "name" : "reduction_conv_1_stem_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "activation_1_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_2_output",
      "type" : "activation",
      "name" : "activation_2",
      "bottom" : "reduction_bn_1_stem_1_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_4_output",
      "type" : "activation",
      "name" : "activation_4",
      "bottom" : "stem_bn1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_left1_stem_1_output_intermin_",
      "blob_weights" : 9,
      "K" : 11,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_left1_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_2_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_3_output",
      "blob_weights" : 13,
      "K" : 11,
      "blob_biases" : 11,
      "name" : "separable_conv_1_reduction_left1_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_1_reduction_left1_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_1_stem_1_output_intermin_",
      "blob_weights" : 15,
      "K" : 32,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_1_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_4_output",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_5_output",
      "blob_weights" : 19,
      "K" : 32,
      "blob_biases" : 17,
      "name" : "separable_conv_1_reduction_1_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_1_reduction_1_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_left1_stem_1_output_intermin_",
      "blob_weights" : 21,
      "K" : 11,
      "name" : "separable_conv_2_reduction_left1_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_3_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_left1_stem_1_output",
      "blob_weights" : 25,
      "K" : 11,
      "blob_biases" : 23,
      "name" : "separable_conv_2_reduction_left1_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_2_reduction_left1_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_1_stem_1_output_intermin_",
      "blob_weights" : 27,
      "K" : 11,
      "name" : "separable_conv_2_reduction_1_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_5_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 7,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_1_stem_1_output",
      "blob_weights" : 31,
      "K" : 11,
      "blob_biases" : 29,
      "name" : "separable_conv_2_reduction_1_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_2_reduction_1_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_6_output",
      "type" : "activation",
      "name" : "activation_6",
      "bottom" : "stem_bn1_output"
    },
    {
      "alpha" : 1,
      "bottom" : "separable_conv_2_bn_reduction_left1_stem_1_output,separable_conv_2_bn_reduction_1_stem_1_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add_1_stem_1_output",
      "type" : "elementwise",
      "name" : "reduction_add_1_stem_1",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_right2_stem_1_output_intermin_",
      "blob_weights" : 33,
      "K" : 32,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_right2_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_6_output",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_7_output",
      "blob_weights" : 37,
      "K" : 32,
      "blob_biases" : 35,
      "name" : "separable_conv_1_reduction_right2_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_1_reduction_right2_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_8_output",
      "type" : "activation",
      "name" : "activation_8",
      "bottom" : "stem_bn1_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_10_output",
      "type" : "activation",
      "name" : "activation_10",
      "bottom" : "reduction_add_1_stem_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_right3_stem_1_output_intermin_",
      "blob_weights" : 39,
      "K" : 32,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_right3_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 32,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 32,
      "bottom" : "activation_8_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_9_output",
      "blob_weights" : 43,
      "K" : 32,
      "blob_biases" : 41,
      "name" : "separable_conv_1_reduction_right3_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_1_reduction_right3_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_left4_stem_1_output_intermin_",
      "blob_weights" : 45,
      "K" : 11,
      "name" : "separable_conv_1_reduction_left4_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_10_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_11_output",
      "blob_weights" : 49,
      "K" : 11,
      "blob_biases" : 47,
      "name" : "separable_conv_1_reduction_left4_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_1_reduction_left4_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_right2_stem_1_output_intermin_",
      "blob_weights" : 51,
      "K" : 11,
      "name" : "separable_conv_2_reduction_right2_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_7_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 7,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_right2_stem_1_output",
      "blob_weights" : 55,
      "K" : 11,
      "blob_biases" : 53,
      "name" : "separable_conv_2_reduction_right2_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_2_reduction_right2_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_bn_1_stem_1_output",
      "pad_l" : 0,
      "name" : "reduction_left2_stem_1",
      "top" : "reduction_left2_stem_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_right3_stem_1_output_intermin_",
      "blob_weights" : 57,
      "K" : 11,
      "name" : "separable_conv_2_reduction_right3_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_9_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_right3_stem_1_output",
      "blob_weights" : 61,
      "K" : 11,
      "blob_biases" : 59,
      "name" : "separable_conv_2_reduction_right3_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_2_reduction_right3_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_left4_stem_1_output_intermin_",
      "blob_weights" : 63,
      "K" : 11,
      "name" : "separable_conv_2_reduction_left4_stem_1_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 11,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "activation_11_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_left4_stem_1_output",
      "blob_weights" : 67,
      "K" : 11,
      "blob_biases" : 65,
      "name" : "separable_conv_2_reduction_left4_stem_1_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 11,
      "bottom" : "separable_conv_2_reduction_left4_stem_1_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "adjust_relu_1_stem_2_output",
      "type" : "activation",
      "name" : "adjust_relu_1_stem_2",
      "bottom" : "stem_bn1_output"
    },
    {
      "alpha" : 1,
      "bottom" : "reduction_left2_stem_1_output,separable_conv_2_bn_reduction_right2_stem_1_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add_2_stem_1_output",
      "type" : "elementwise",
      "name" : "reduction_add_2_stem_1",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_bn_1_stem_1_output",
      "pad_l" : 0,
      "name" : "reduction_left3_stem_1",
      "top" : "reduction_left3_stem_1_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 1,
      "pad_mode" : 1,
      "stride_y" : 1,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_add_1_stem_1_output",
      "pad_l" : 0,
      "name" : "reduction_left4_stem_1",
      "top" : "reduction_left4_stem_1_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_bn_1_stem_1_output",
      "pad_l" : 0,
      "name" : "reduction_right5_stem_1",
      "top" : "reduction_right5_stem_1_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_1_output",
      "pad_pad_mode" : 0,
      "pad_t" : 0,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "adjust_relu_1_stem_2_output",
      "pad_l" : 0,
      "name" : "zero_padding2d_1",
      "weights" : {

      }
    },
    {
      "alpha" : 1,
      "bottom" : "reduction_left3_stem_1_output,separable_conv_2_bn_reduction_right3_stem_1_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add3_stem_1_output",
      "type" : "elementwise",
      "name" : "reduction_add3_stem_1",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "reduction_add_2_stem_1_output,reduction_left4_stem_1_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_1_output",
      "type" : "elementwise",
      "name" : "add_1",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "separable_conv_2_bn_reduction_left4_stem_1_output,reduction_right5_stem_1_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add4_stem_1_output",
      "type" : "elementwise",
      "name" : "reduction_add4_stem_1",
      "beta" : 0
    },
    {
      "bottom" : "zero_padding2d_1_output",
      "t" : 1,
      "weights" : {

      },
      "l" : 1,
      "r" : 0,
      "top" : "cropping2d_1_output",
      "type" : "crop",
      "name" : "cropping2d_1",
      "b" : 0
    },
    {
      "weights" : {

      },
      "top" : "reduction_concat_stem_1_output",
      "type" : "concat",
      "name" : "reduction_concat_stem_1",
      "bottom" : "reduction_add_2_stem_1_output,reduction_add3_stem_1_output,add_1_output,reduction_add4_stem_1_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 1,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 1,
      "pad_fill_mode" : 0,
      "bottom" : "adjust_relu_1_stem_2_output",
      "pad_l" : 0,
      "name" : "adjust_avg_pool_1_stem_2",
      "top" : "adjust_avg_pool_1_stem_2_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 1,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 1,
      "pad_fill_mode" : 0,
      "bottom" : "cropping2d_1_output",
      "pad_l" : 0,
      "name" : "adjust_avg_pool_2_stem_2",
      "top" : "adjust_avg_pool_2_stem_2_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_12_output",
      "type" : "activation",
      "name" : "activation_12",
      "bottom" : "reduction_concat_stem_1_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "adjust_conv_1_stem_2_output",
      "blob_weights" : 69,
      "K" : 32,
      "name" : "adjust_conv_1_stem_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "adjust_avg_pool_1_stem_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "adjust_conv_2_stem_2_output",
      "blob_weights" : 71,
      "K" : 32,
      "name" : "adjust_conv_2_stem_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 11,
      "bottom" : "adjust_avg_pool_2_stem_2_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "reduction_bn_1_stem_2_output",
      "blob_weights" : 75,
      "K" : 44,
      "blob_biases" : 73,
      "name" : "reduction_conv_1_stem_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "activation_12_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "top" : "concatenate_1_output",
      "type" : "concat",
      "name" : "concatenate_1",
      "bottom" : "adjust_conv_1_stem_2_output,adjust_conv_2_stem_2_output"
    },
    {
      "name" : "adjust_bn_stem_2",
      "bottom" : "concatenate_1_output",
      "weights" : {

      },
      "top" : "adjust_bn_stem_2_output",
      "C" : 22,
      "blob_batchnorm_params" : 77,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_13_output",
      "type" : "activation",
      "name" : "activation_13",
      "bottom" : "reduction_bn_1_stem_2_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_15_output",
      "type" : "activation",
      "name" : "activation_15",
      "bottom" : "adjust_bn_stem_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_left1_stem_2_output_intermin_",
      "blob_weights" : 79,
      "K" : 22,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_left1_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_13_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_14_output",
      "blob_weights" : 83,
      "K" : 22,
      "blob_biases" : 81,
      "name" : "separable_conv_1_reduction_left1_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_1_reduction_left1_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_1_stem_2_output_intermin_",
      "blob_weights" : 85,
      "K" : 22,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_1_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_15_output",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_16_output",
      "blob_weights" : 89,
      "K" : 22,
      "blob_biases" : 87,
      "name" : "separable_conv_1_reduction_1_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_1_reduction_1_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_left1_stem_2_output_intermin_",
      "blob_weights" : 91,
      "K" : 22,
      "name" : "separable_conv_2_reduction_left1_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_14_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_left1_stem_2_output",
      "blob_weights" : 95,
      "K" : 22,
      "blob_biases" : 93,
      "name" : "separable_conv_2_reduction_left1_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_2_reduction_left1_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_1_stem_2_output_intermin_",
      "blob_weights" : 97,
      "K" : 22,
      "name" : "separable_conv_2_reduction_1_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_16_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 7,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_1_stem_2_output",
      "blob_weights" : 101,
      "K" : 22,
      "blob_biases" : 99,
      "name" : "separable_conv_2_reduction_1_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_2_reduction_1_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_17_output",
      "type" : "activation",
      "name" : "activation_17",
      "bottom" : "adjust_bn_stem_2_output"
    },
    {
      "alpha" : 1,
      "bottom" : "separable_conv_2_bn_reduction_left1_stem_2_output,separable_conv_2_bn_reduction_1_stem_2_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add_1_stem_2_output",
      "type" : "elementwise",
      "name" : "reduction_add_1_stem_2",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_right2_stem_2_output_intermin_",
      "blob_weights" : 103,
      "K" : 22,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_right2_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_17_output",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_18_output",
      "blob_weights" : 107,
      "K" : 22,
      "blob_biases" : 105,
      "name" : "separable_conv_1_reduction_right2_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_1_reduction_right2_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_19_output",
      "type" : "activation",
      "name" : "activation_19",
      "bottom" : "adjust_bn_stem_2_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_21_output",
      "type" : "activation",
      "name" : "activation_21",
      "bottom" : "reduction_add_1_stem_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_right3_stem_2_output_intermin_",
      "blob_weights" : 109,
      "K" : 22,
      "stride_x" : 2,
      "name" : "separable_conv_1_reduction_right3_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_19_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_20_output",
      "blob_weights" : 113,
      "K" : 22,
      "blob_biases" : 111,
      "name" : "separable_conv_1_reduction_right3_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_1_reduction_right3_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_reduction_left4_stem_2_output_intermin_",
      "blob_weights" : 115,
      "K" : 22,
      "name" : "separable_conv_1_reduction_left4_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_21_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_22_output",
      "blob_weights" : 119,
      "K" : 22,
      "blob_biases" : 117,
      "name" : "separable_conv_1_reduction_left4_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_1_reduction_left4_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_right2_stem_2_output_intermin_",
      "blob_weights" : 121,
      "K" : 22,
      "name" : "separable_conv_2_reduction_right2_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_18_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 7,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_right2_stem_2_output",
      "blob_weights" : 125,
      "K" : 22,
      "blob_biases" : 123,
      "name" : "separable_conv_2_reduction_right2_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_2_reduction_right2_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_bn_1_stem_2_output",
      "pad_l" : 0,
      "name" : "reduction_left2_stem_2",
      "top" : "reduction_left2_stem_2_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_right3_stem_2_output_intermin_",
      "blob_weights" : 127,
      "K" : 22,
      "name" : "separable_conv_2_reduction_right3_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_20_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_right3_stem_2_output",
      "blob_weights" : 131,
      "K" : 22,
      "blob_biases" : 129,
      "name" : "separable_conv_2_reduction_right3_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_2_reduction_right3_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_reduction_left4_stem_2_output_intermin_",
      "blob_weights" : 133,
      "K" : 22,
      "name" : "separable_conv_2_reduction_left4_stem_2_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 22,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "activation_22_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_2_bn_reduction_left4_stem_2_output",
      "blob_weights" : 137,
      "K" : 22,
      "blob_biases" : 135,
      "name" : "separable_conv_2_reduction_left4_stem_2_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 22,
      "bottom" : "separable_conv_2_reduction_left4_stem_2_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "adjust_relu_1_0_output",
      "type" : "activation",
      "name" : "adjust_relu_1_0",
      "bottom" : "reduction_concat_stem_1_output"
    },
    {
      "alpha" : 1,
      "bottom" : "reduction_left2_stem_2_output,separable_conv_2_bn_reduction_right2_stem_2_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add_2_stem_2_output",
      "type" : "elementwise",
      "name" : "reduction_add_2_stem_2",
      "beta" : 0
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_bn_1_stem_2_output",
      "pad_l" : 0,
      "name" : "reduction_left3_stem_2",
      "top" : "reduction_left3_stem_2_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 1,
      "pad_mode" : 1,
      "stride_y" : 1,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_add_1_stem_2_output",
      "pad_l" : 0,
      "name" : "reduction_left4_stem_2",
      "top" : "reduction_left4_stem_2_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 1,
      "stride_x" : 2,
      "pad_mode" : 1,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 3,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 3,
      "pad_fill_mode" : 0,
      "bottom" : "reduction_bn_1_stem_2_output",
      "pad_l" : 0,
      "name" : "reduction_right5_stem_2",
      "top" : "reduction_right5_stem_2_output"
    },
    {
      "pad_value" : 0,
      "top" : "zero_padding2d_2_output",
      "pad_pad_mode" : 0,
      "pad_t" : 0,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 0,
      "bottom" : "adjust_relu_1_0_output",
      "pad_l" : 0,
      "name" : "zero_padding2d_2",
      "weights" : {

      }
    },
    {
      "alpha" : 1,
      "bottom" : "reduction_left3_stem_2_output,separable_conv_2_bn_reduction_right3_stem_2_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add3_stem_2_output",
      "type" : "elementwise",
      "name" : "reduction_add3_stem_2",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "reduction_add_2_stem_2_output,reduction_left4_stem_2_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "add_2_output",
      "type" : "elementwise",
      "name" : "add_2",
      "beta" : 0
    },
    {
      "alpha" : 1,
      "bottom" : "separable_conv_2_bn_reduction_left4_stem_2_output,reduction_right5_stem_2_output",
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "top" : "reduction_add4_stem_2_output",
      "type" : "elementwise",
      "name" : "reduction_add4_stem_2",
      "beta" : 0
    },
    {
      "bottom" : "zero_padding2d_2_output",
      "t" : 1,
      "weights" : {

      },
      "l" : 1,
      "r" : 0,
      "top" : "cropping2d_2_output",
      "type" : "crop",
      "name" : "cropping2d_2",
      "b" : 0
    },
    {
      "weights" : {

      },
      "top" : "reduction_concat_stem_2_output",
      "type" : "concat",
      "name" : "reduction_concat_stem_2",
      "bottom" : "reduction_add_2_stem_2_output,reduction_add3_stem_2_output,add_2_output,reduction_add4_stem_2_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 1,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 1,
      "pad_fill_mode" : 0,
      "bottom" : "adjust_relu_1_0_output",
      "pad_l" : 0,
      "name" : "adjust_avg_pool_1_0",
      "top" : "adjust_avg_pool_1_0_output"
    },
    {
      "pad_value" : 0,
      "average_count_exclude_padding" : 1,
      "top_shape_style" : 0,
      "avg_or_max" : 0,
      "stride_x" : 2,
      "pad_mode" : 2,
      "stride_y" : 2,
      "pad_t" : 0,
      "weights" : {

      },
      "size_y" : 1,
      "type" : "pool",
      "pad_r" : 0,
      "pad_b" : 0,
      "size_x" : 1,
      "pad_fill_mode" : 0,
      "bottom" : "cropping2d_2_output",
      "pad_l" : 0,
      "name" : "adjust_avg_pool_2_0",
      "top" : "adjust_avg_pool_2_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "adjust_conv_1_0_output",
      "blob_weights" : 139,
      "K" : 44,
      "name" : "adjust_conv_1_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "adjust_avg_pool_1_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "adjust_conv_2_0_output",
      "blob_weights" : 141,
      "K" : 44,
      "name" : "adjust_conv_2_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 22,
      "bottom" : "adjust_avg_pool_2_0_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_23_output",
      "type" : "activation",
      "name" : "activation_23",
      "bottom" : "reduction_concat_stem_2_output"
    },
    {
      "weights" : {

      },
      "top" : "concatenate_2_output",
      "type" : "concat",
      "name" : "concatenate_2",
      "bottom" : "adjust_conv_1_0_output,adjust_conv_2_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "normal_bn_1_0_output",
      "blob_weights" : 145,
      "K" : 88,
      "blob_biases" : 143,
      "name" : "normal_conv_1_0",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "activation_23_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "name" : "adjust_bn_0",
      "bottom" : "concatenate_2_output",
      "weights" : {

      },
      "top" : "adjust_bn_0_output",
      "C" : 44,
      "blob_batchnorm_params" : 147,
      "type" : "batchnorm"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_24_output",
      "type" : "activation",
      "name" : "activation_24",
      "bottom" : "normal_bn_1_0_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_26_output",
      "type" : "activation",
      "name" : "activation_26",
      "bottom" : "adjust_bn_0_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_28_output",
      "type" : "activation",
      "name" : "activation_28",
      "bottom" : "adjust_bn_0_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_30_output",
      "type" : "activation",
      "name" : "activation_30",
      "bottom" : "adjust_bn_0_output"
    },
    {
      "mode" : 0,
      "weights" : {

      },
      "top" : "activation_32_output",
      "type" : "activation",
      "name" : "activation_32",
      "bottom" : "normal_bn_1_0_output"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_normal_left1_0_output_intermin_",
      "blob_weights" : 149,
      "K" : 44,
      "name" : "separable_conv_1_normal_left1_0_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 44,
      "bottom" : "activation_24_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 5,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "activation_25_output",
      "blob_weights" : 153,
      "K" : 44,
      "blob_biases" : 151,
      "name" : "separable_conv_1_normal_left1_0_step_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 44,
      "bottom" : "separable_conv_1_normal_left1_0_output_intermin_",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 1,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "separable_conv_1_normal_right1_0_output_intermin_",
      "blob_weights" : 155,
      "K" : 44,
      "name" : "separable_conv_1_normal_right1_0_step_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 44,
      "pad_t" : 0,
      "has_biases" : 0,
      "C" : 44,
      "bottom" : "activation_26_output",
      "weights" : {

      },
      "pad_mode" : 1,
      "Nx" : 3,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
